{
  "Home": {
    "razart": "RazArt",
    "gm": "Gabriela Menkiewicz",
    "about": {
      "line1": "Frontend developer with a knack for user experience and visual aesthetics.",
      "line2": "Passionate about long walks as well as loosing oneself in well written storytelling."
    },
    "gdpr": "I authorise the processing of personal data contained in my curriculum vitae based on art. 13 GDPR 679/16."
  },
  "Experience": {
    "title": "Experience",
    "present": "present",
    "highlights": "Highlights",
    "tech": "Technologies",
    "tools": "Tools",
    "company": {
      "bc": "British Council",
      "spaceOS": "spaceOS",
      "cegedim": "Cegedim / IMS Health / QuintilesIMS",
      "plum": "PLUM - Web Solutions",
      "freelance": "Freelance",
      "univox": "Univox",
      "efy": "English For You"
    },
    "position": {
      "principal": "Principal Front-end Developer",
      "engineer": "Software Engineer",
      "tester": "Tester",
      "fe": "Front-end Developer",
      "tl": "Team Lead"
    },
    "location": {
      "remote": "remote",
      "hybrid": "hybrid",
      "onsite": "on-site"
    },
    "relation": {
      "contract": "contract",
      "fulltime": "full-time",
      "parttime": "part-time"
    },
    "spaceOS": {
      "desc": "I became part of a dynamic team of great developers working on an evolving startup project creating an app for workspace users and managers. My role was focused on bringing new designs to life in our web app.",
      "hl1": "Translated new design requirements into Angular code, ensuring seamless integration of visual elements with functional components.",
      "hl2": "Conducted thorough testing of implementations to guarantee reliability and performance.",
      "hl3": "Maintained the codebase at top quality and efficiency, adhering to best practices and coding standards.",
      "hl4": "Participated actively in discussions about the organisation of work and technologies used, contributing insights and ideas to improve processes and workflows."
    },
    "bc": {
      "fe1": {
        "desc": "I joined a rapidly growing number of contractors working on a comprehensive platform designed to enhance planning, registering and administrating examination sessions. My primary role was to develop front-end applications in coordination with the back-end code being developed at the same time. As my experience and business knowledge grew, I transitioned to designing parts of the user interface from the scratch as well.",
        "hl1": "Conducted proactive research on available technologies applicable to the project, ensuring informed decision-making and optimal technology selection.",
        "hl2": "Implemented provided prototypes and proposed necessary corrections to enhance functionality and usability.",
        "hl3": "Ensured proper user experience and accessibility standards were met, enhancing usability and inclusivity.",
        "hl4": "Maintained synchronisation between front-end and back-end code, facilitating seamless integration and collaboration across development teams.",
        "hl5": "Wrote comprehensive unit tests for front-end code, ensuring code quality and reliability.",
        "hl6": "Assisted in debugging both front-end and back-end code, providing valuable support in troubleshooting and issue resolution.",
        "hl7": "Estimated time requirements for front-end tasks, aiding in project planning and resource allocation.",
        "hl8": "Created high-fidelity UI prototypes, visualising design concepts and facilitating stakeholder understanding and feedback.",
        "hl9": "Conducted peer reviews, fostering collaboration and code quality assurance through constructive feedback and collaboration."
      },
      "tl": {
        "desc": "Over two years into the project gave me enough insight to take over a leadership role in my team. I would still design most of our prototypes but leave the development to my team and take on the responsibility for delivering whole functionalities.",
        "hl1": "Managed and consistently met attainable business expectations while upholding high coding standards, ensuring the delivery of quality software products.",
        "hl2": "Maintained a comprehensive understanding of the entire development process, facilitating effective decision-making and strategic planning.",
        "hl3": "Consulted with architects to minimise technical debt and ensure the scalability and maintainability of the software architecture.",
        "hl4": "Conducted peer reviews and managed merge processes to uphold code integrity and collaboration standards.",
        "hl5": "Configured and maintained a stable continuous integration environment, facilitating seamless development workflows.",
        "hl6": "Built and deployed newly developed code to dedicated testing environments, facilitating efficient testing and feedback cycles.",
        "hl7": "Facilitated team meetings, including daily scrums as well as review, retro, planning and refinement sessions, to foster collaboration and alignment.",
        "hl8": "Developed sprint plans collaboratively with the team, leveraging insights and input to optimise productivity and delivery.",
        "hl9": "Coordinated work with other team leaders and the development leader to ensure cross-functional collaboration and alignment.",
        "hl10": "Communicated and collaborated with the BI team to explain and discuss the impact of development work, fostering synergy and alignment.",
        "hl11": "Supported pre-release QA and UAT processes by maintaining environments, gathering feedback, and scheduling improvements, ensuring successful product releases.",
        "hl12": "Provided mentorship and support to team members, fostering focus on goals and facilitating career growth and development."
      },
      "fe2": {
        "desc": "I was welcomed back into a team building a brand new registration platform capable of scaling to offer new products as well as handling a variety of self-serve features.",
        "hl1": "Demonstrated business value delivered by the team to stakeholders, showcasing tangible outcomes and achievements.",
        "hl2": "Unified data from up to 4 separate APIs for a shared UI, streamlining processes and enhancing user experience.",
        "hl3": "Brainstormed with our UX specialist on shapes and forms of UI elements, ensuring intuitive and user-friendly design.",
        "hl4": "Made iterative improvements to the UI based on gathered insights, fostering continuous enhancement and refinement.",
        "hl5": "Managed content still under development behind feature flags, allowing for controlled release and testing.",
        "hl6": "Implemented A/B tests to optimise user engagement and drive performance improvements.",
        "hl7": "Collaborated with the analytics team to properly capture user interactions, informing data-driven decision-making.",
        "hl8": "Facilitated the onboarding process for new team members, ensuring seamless integration and knowledge transfer.",
        "hl9": "Integrated with translation mechanisms to support multilingual functionality.",
        "hl10": "Ensured both client and server-side translations were properly fetched on language switch, enhancing accessibility and user inclusivity."
      }
    },
    "cegedim": {
      "desc": "The division I worked in, the ECC (EMEA Customization Center), was responsible for deployment and technical support of Nexxus Mobile Intelligence — a leading customer relationship management system dedicated to life sciences on the market. We provided our technical skills as well as deep knowledge of the CRM in all of its supported versions to our pharmaceutical clients around the globe.",
      "hl1": "Configured the front-end interface of the CRM, optimising usability and functionality for end-users.",
      "hl2": "Authored reports in PL/SQL and integrated them into the CRM, facilitating data-driven decision-making and analysis.",
      "hl3": "Optimised and corrected existing PL/SQL queries, improving efficiency and accuracy in data retrieval.",
      "hl4": "Enhanced user experience through the implementation of server-side (C#) and client-side (JavaScript) scripts, enhancing system functionality and interactivity.",
      "hl5": "Addressed user-reported requests by identifying and implementing optimal solutions, fostering user satisfaction and system usability.",
      "hl6": "Conducted data analysis to extract actionable insights and inform strategic decision-making processes, driving business success and growth."
    },
    "plum": {
      "desc": "Plum is a small but feisty interactive agency specialised in e-commerce. Although I was officially employed as a tester, I quickly started doing daily tasks of a front-end developer.",
      "hl1": "Conducted pre- and post-release tests, ensuring software quality and reliability throughout the development lifecycle.",
      "hl2": "Managed and configured Magento systems, optimising performance and functionality.",
      "hl3": "Designed, prepared, tested, and distributed newsletters using Freshmail, fostering customer engagement and communication.",
      "hl4": "Enhanced product photos to improve visual appeal and marketing effectiveness.",
      "hl5": "Optimised CSS code to enhance website performance and user experience."
    },
    "freelance": {
      "desc": "As a freelancer, I specialised in designing, building, and installing websites, leveraging WordPress for content management. Additionally, I adeptly set up and managed Google Analytics and AdWords accounts to optimise online visibility and drive traffic. Beyond web development, I showcased my creativity by designing logos, leaflets, business cards, and various marketing materials, ensuring cohesive branding and effective communication strategies for clients."
    },
    "univox": {
      "desc": "At Univox, an online music shop offering CDs and DVDs, I played a pivotal role in managing the product database and overseeing the sales process. My responsibilities included updating product listings, ensuring accuracy and completeness, and managing inventory levels to meet customer demand. Furthermore, I created compelling advertising content to promote featured products and special offers, contributing to increased sales and customer engagement."
    },
    "efy": {
      "desc": "As a receptionist at a language school, I provided exceptional customer service to students and visitors, serving as the primary point of contact for inquiries and assistance. In addition to administrative tasks, I conducted entrance exams for prospective students, ensuring a smooth admissions process. Leveraging my proficiency in picture editing software, I also contributed to the school's image campaign by creating visually appealing materials and enhancing promotional content."
    }
  },
  "Education": {
    "title": "Education",
    "pw": {
      "title": "Warsaw University of Technology",
      "fields": "Computer Science, Software Engineering",
      "degree": "Master of Science",
      "courses": "Courses",
      "master": "Master thesis: “Requirement model transformation into presentation layer in Flex technology”",
      "bachelor": "Bachelor thesis: “Web application project and mock-up — multimedia catalogue”"
    }
  },
  "Skills": {
    "title": "Skills",
    "dev": "Technologies",
    "platforms": "Platforms",
    "soft": "Software"
  },
  "Languages": {
    "title": "Languages",
    "english": "English",
    "polish": "Polish",
    "japanese": "Japanese",
    "proficient": "Full proficiency",
    "native": "Native speaker",
    "elementary": "Elementary"
  },
  "Interests": {
    "title": "Interests",
    "line1": "Indoors I enjoy gaming, reading and watching all sorts of fiction as well as playing cardboard games.",
    "line2": "Outdoors I usually simply wander wherever my feet would take me."
  }
}
